---
kind: property
id: P:Autodesk.Revit.DB.CurtainGrid.Grid2Angle
source: html/11030f5d-fb11-423e-5a00-6e7318eb7fcd.htm
---
# Autodesk.Revit.DB.CurtainGrid.Grid2Angle Property

The angle for V grid line pattern of the curtain grid.

## Syntax (C#)
```csharp
public double Grid2Angle { get; set; }
```